Repository: vjousse/vim-for-humans-website
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Back to the website
fr: Retour au site

source: Payment cancelled
fr: Paiement annulé

source: Your payment was cancelled or an error occurred. Please try again.
fr: Votre paiement a été annulé ou une erreur s'est produite. Veuillez ré-essayer.

source: Thank you!
fr: Merci !

source: Thanks for downloading "Vim for humans"! Don't forget to contribute with one of the following way:
fr: Merci d'avoir téléchargé "Vim pour les humains" ! N'oubliez pas de contribuer par l'un des moyens suivant :

source: A little thank you by mail:
fr: Un petit merci par email :

source: Something else?
fr: Quelque chose d'autre ?

source: Download
fr: Télécharger

source: vim-for-humans
fr: vim-pour-les-humains

source: PDF Format
fr: Format pdf

source: Epub Format
fr: Format epub

source: Mobi Format
fr: Format mobi

source: Your contribution has been recorded and your payment of <strong> %(amount)s</strong> € validated.<br />You can save <a href="%(request)s">the link to this page</a> to download the book again later on.<br />20%% of the earnings are donated to <a href="http://www.framasoft.net/">Framasoft</a>, an association promoting Free Software.
fr: Votre contribution a bien été enregistrée et votre paiement de <strong> %(amount)s</strong> € validé.<br />Vous pouvez <a href="%(request)s">sauvegarder le lien vers cette page</a> pour télécharger le livre de nouveau plus tard.<br />20%% des gains sont reversés à <a href="http://www.framasoft.net/">Framasoft</a>, une association de promotion du logiciel libre.

source: The best way to stay efficient while learning Vim
fr: La meilleure façon de rester productif en apprenant Vim

source: <span>Or how to overcome the <span class="color">famous</span> question<span><br /><span>"How do I quit this <span class="color">@#!?</span>"</span>
fr: <span>Ou comment répondre à la <span class="color">fameuse</span> question<span><br /><span>"Comment est-ce que je quitte cette <span class="color">@#!?</span>"</span>

source: Download the ebook
fr: Télécharger l'ebook

source: Learn Vim the smart way
fr: Apprenez Vim intelligemment

source: I'm convinced that everybody should be able to learn Vim and that it's just a problem of documentation. With this ebook you will:
fr: Je suis convaincu que tout le monde peut apprendre à utiliser Vim et qu'il manque juste une documentation efficace. Avec ce livre vous allez :

source: Stay productive while learning Vim
fr: Rester productif tout en apprenant Vim

source: Get a modern customizable IDE
fr: Avoir un IDE moderne et personnalisable

source: Learn why Vim seems so strange
fr: Apprendre pourquoi Vim parait si étrange

source: Get a selection of the best Vim plugins
fr: Bénéficier des meilleurs plugins

source: Have fun :-)
fr: Vous amuser :-)

source: Content
fr: Contenu

source: Yum yum
fr: Miam miam

source: Good looking Vim
fr: Vim sexy

source: It's not because we are geeks that we should use awful color schemes. Or should we?
fr: Ce n'est pas parce que l'on est geek qu'on doit avoir des couleurs affreuses. Ou alors si&nbsp;?

source: Plugin selection
fr: Sélection de plugins

source: Using Vim without plugins doesn't make any sense. It's like using a Smartphone without any app.
fr: Utiliser Vim sans plugin n'a pas de sens. C'est comme utiliser un Smartphone sans application.

source: Smooth learning curve
fr: Apprentissage en douceur

source: If you don't quit the first week, you'll be using it for the rest of your life. It's my bet!
fr: Si vous n'abandonnez pas la première semaine, vous l'utiliserez pour le reste de votre vie. C'est le défi que je me suis donné !

source: You are free to do whatever you want (well, almost, see the licence details <a href="http://creativecommons.org/licenses/by/4.0/">here</a>) with the ebook.
fr: Vous êtes libre de faire ce que vous voulez (enfin presque, vous pouvez <a href="http://creativecommons.org/licenses/by/4.0/">consulter les détails de la licence</a>) avec l'ebook.

source: Free price
fr: Prix libre

source: You're free to pay whatever you want. Money, <a href="https://flattr.com/profile/vjousse">Flattr</a>, email or a thank you are fine. More <a href="https://ploum.net/the-disruptive-free-price/">about free price here</a>.
fr: Vous êtes libre de payer le prix que vous voulez. De l' argent, un <a href="https://flattr.com/profile/vjousse">Flattr</a>, un email ou un merci feront très bien l'affaire. <a href="http://ploum.net/le-prix-libre-une-impossible-utopie/">Plus d'infos au sujet du prix libre ici.</a>

source: The entire source code is available on my <a href="https://github.com/vjousse/vim-for-humans-book">Github profile</a>. Be sure to check it out!
fr: Le code source complet du livre est disponible sur mon <a href="https://github.com/vjousse/vim-for-humans-book">profil Github</a>. Allez y jeter un œil&nbsp;!

source: A brief overview of the advantages of vim and why it is one of the best investments you can make in your career.
fr: Petit tour d’horizon des avantages de vim et de pourquoi c’est un des meilleurs investissements que vous pouvez réaliser dans votre carrière.

source: Usable Vim
fr: Rendre Vim utilisable

source: In this chapter we see how to configure Vim to make it usable by a "normal" human. Syntax highlighting, file explorer (The NERD Tree), color scheme (Solarized), using the mouse ... We also discuss why it is important to abandon the mouse for the health of your hands / fingers. You can also directly <a href="%(link)s">download the entire chapter</a>.
fr: Nous voyons ici comment configurer Vim pour qu’il soit utilisable par un humain « normal ». Coloration syntaxique, explorateur de fichiers (The NERD Tree), thème de couleurs (Solarized), utilisation de la souris, … Nous abordons aussi pourquoi il sera important de se passer de la souris pour la santé de vos mains/doigts. Vous pouvez d'ailleurs directement <a href="%(link)s">télécharger le chapitre entier</a>.

source: The text editor you've always dreamed of
fr: L’outil de manipulation de texte rêvé

source: Once you will be able to use Vim "normally" thanks to the previous chapter, we will see here how to take full advantage of Vim. We introduce keyboard shortcuts as well as modes. We begin by gradually to do without the mouse.
fr: Une fois que vous pouvez utiliser Vim « normalement » grâce au chapitre précédent, nous voyons ici comment en tirer pleinement partie. Nous introduisons les raccourcis claviers ainsi que les modes. Nous commençons petit à petit par nous passer de la souris.

source: Essential plugins
fr: Les plugins indispensables

source: In this chapter, we put Vim to the next level. We add plugins such as Lusty Explorer (file explorer using the keyboard), Ack (file search) or Ctrl-p (fast searching/opening of files).
fr: Dans ce chapitre, nous faisons passer Vim au niveau supérieur. Nous lui ajoutons des plugins tels que Lusty Explorer (explorateur de fichiers au clavier), Ack (recherche dans les fichiers) ou encore Ctrl-p (recherche / ouverture rapide de fichiers).

source: Cheatsheet & examples
fr: Pense-bête et exemples

source: We finally provide a set of useful/essential shortcuts to master keyboard text editing.
fr: Nous finissons par fournir un ensemble de raccourcis claviers utiles et/ou indispensables pour maitriser l’édition de texte au clavier.

source: Download the first chapter!
fr: Télécharger le premier chapitre !

source: OR
fr: OU

source: Frequently Asked Questions
fr: Foire Aux Questions

source: Would this site be serious without a FAQ?
fr: Parce que tout site se respectant mérite sa FAQ

source: Is it really free?
fr: Est-ce que c'est vraiment gratuit ?

source: Free price doesn't mean that it's free. I firmly believe that everybody has something to give in exchange of this ebook. The difference is just that I let you fix the price. It can be whatever you want: money, <a href="https://flattr.com/profile/vjousse">Flattr</a>, email or a thank you are fine. More <a href="https://ploum.net/the-disruptive-free-price/">about free price here</a>.
fr: Prix libre ne veux pas dire que c'est gratuit. Je suis convaincu que chaque personne a quelque chose à apporter en échange de cet ebook. Je vous laisse donc choisir quoi. Vous êtes libre de payer le prix que vous voulez. De l' argent, un <a href="https://flattr.com/profile/vjousse">Flattr</a>, un email ou un merci feront très bien l'affaire. <a href="http://ploum.net/le-prix-libre-une-impossible-utopie/">Plus d'infos au sujet du prix libre ici.</a>

source: Can I get a preview of the content?
fr: Est-ce que je peux avoir un aperçu du contenu ?

source: Sure, you can even
fr: Bien sûr, vous pouvez même

source: download the first chapter
fr: télécharger le premier chapitre !

source: Is this ebook suited for Vim experts?
fr: Est-ce que cet ebook est adapté pour les experts de Vim ?

source: Clearly not. This book is for Vim novices wishing not to quit after two days. The goal is to help you take the first step without losing all your productivity. There are a lot of resources available for gurus, like: <a href="http://www.swaroopch.com/notes/vim/">A byte of vim</a>, <a href="http://www.vimbits.com/">Vimbits</a>, <a href="http://www.amazon.fr/gp/product/059652983X/ref=as_li_ss_tl?ie=UTF8&camp=1642&creative=19458&creativeASIN=059652983X&linkCode=as2">Learning The Vi and Vim Editors</a> and <a href="http://www.amazon.fr/gp/product/1934356980/ref=as_li_ss_tl?ie=UTF8&camp=1642&creative=19458&creativeASIN=1934356980&linkCode=as2">Practical Vim</a>.
fr: Clairement pas. Ce livre s'adresse aux novices de Vim désirant bénéficier d'un moyen pour ne pas l’abandonner au bout de deux jours. Le but est de vous mettre le pied à l'étrier et de vous permettre de franchir la première marche sans perdre toute votre productivité. Libre à vous ensuite d'utiliser toutes les ressources disponibles sur internet pour maitriser les subtilités les plus obscures de Vim.

source: Can I thank you and share the love?
fr: Est-ce que je peux vous remercier et faire tourner ?

source: The ebook is published under the CC licence
fr: Cet ebook est publié sous une licence CC

source: So you can share it as you want!
fr: Donc vous pouvez le partager sans soucis !

source: Here we are! Well, almost.
fr: Nous y voilà ! Enfin presque.

source: Choose your free price payment method
fr: Choisissez votre manière de payer librement

source: Credit Card
fr: Carte bleue

source: Starting at 0€
fr: À partir de 0€

source: Old school
fr: À l'ancienne

source: Flattr my page
fr: Flattr ma page

source: Hype!
fr: La classe !

source: Share the love
fr: Un petit merci

source: Make the payment & get your ebook
fr: Effectuez votre paiement et obtenez votre ebook

source: Contribute and download
fr: Contribuez et téléchargez

source: Average payment:
fr: Moyenne des paiements :

source: Downloads:
fr: Téléchargements :

source: Donations:
fr: Dons :

source: Minimum payment:
fr: Paiement minimum :

source: maximum payment:
fr: paiement maximum :

source: Amount for Framasoft:
fr: Montant pour Framasoft :

source: 20%% of the earnings are donated to the <a href="http://framasoft.net">Framasoft association</a>, promoting Free Software.
fr: 20%% des gains sont reversés à l'association de promotion du logiciel libre <a href="http://framasoft.net">Framasoft</a>.

source: The payment platform used is <a href="http://stripe.com"><strong>Stripe</strong></a>.
fr: La plateforme de paiement utilisée est <a href="http://stripe.com"><strong>Stripe</strong></a>.

source: Company taxes
fr: Impôts entreprise

source: Framasoft donation
fr: Dons Framasoft

source: Remaining
fr: Reste

source: Repartition for 10€
fr: Répartition pour 10€

source: Paypal account:
fr: Compte Paypal :

source: Get the ebook
fr: Télécharger l'ebook

source: Send your bitcoins to:
fr: Envoyez des bitcoins à cette adresse :

source: <strong>Send a thank you to:</strong> <a href="mailto:vincent@jousse.org">vincent@jousse.org</a>, or on Twitter to <a href="http://twitter.com/vjousse">@vjousse</a>.
fr: <strong>Envoyez un merci à :</strong> <a href="mailto:vincent@jousse.org">vincent@jousse.org</a>, ou sur Twitter to <a href="http://twitter.com/vjousse">@vjousse</a>.

source: Vim for humans
fr: Vim pour les humains

source: Vim for humans | Free price ebook
fr: Vim pour les humains | Ebook à prix libre

source: Home
fr: Accueil
